/*
Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
6, 1, 33 -> [6, 1, 33]
*/
int[] myArray = { 1, 2, 5, 7, 19, 27, 29, 30 };
for (int i = 0; myArray.Length < 8; i++)

Console.WriteLine("Вывод массива: ");
for (int i = 0; i < 8; i++)
{
    Console.Write(myArray[i] + " ");
}